︠774eb835-83a2-440f-967d-90d3d43d6ab4s︠

A=matrix(3, 3, [3,3,0, 3,5,0, 0,0,6])
︡a8a4f672-8f7b-4971-9bfe-44fe80164e68︡
︠efdf308c-becd-4946-acbb-fc2c8b1a9df9s︠
A.eigenvalues()
︡bce508fd-2dd1-4df3-8063-315b3029f5eb︡{"stdout":"[6, 0.8377223398316206?, 7.162277660168380?]\n"}︡
︠c9ef2470-83c9-4617-aa06-e8fb7fa0bc6ds︠
A.eigenvectors_left()
︡5ce788c3-9ef8-4eea-91ba-5f2cc441a3b8︡{"stdout":"[(6, [\n(0, 0, 1)\n], 1), (0.8377223398316206?, [(1, -0.7207592200561264?, 0)], 1), (7.162277660168380?, [(1, 1.387425886722794?, 0)], 1)]\n"}︡
︠83597b46-a8b1-4dda-94e9-3f00351da11e︠
